<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports latest version of KeepingYouAwake to your Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.JaniTee.munki.KeepingYouAwake</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>KeepingYouAwake</string>
        <key>pkginfo</key>
        <dict>
	        <key>blocking_applications</key>
			<array>
				<string>KeepingYouAwake</string>
			</array>
			<key>category</key>
			<string></string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>A Caffeine clone for macOS Yosemite, El Capitan and Sierra (including Dark Mode).</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
			<string>Marcel Dierkes</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.JaniTee.download.Viscosity</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
