<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KeepingYouAwake.</string>
	<key>Identifier</key>
	<string>com.github.JaniTee.download.KeepingYouAwake</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KeepingYouAwake</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://github.com/newmarcel/KeepingYouAwake/releases/download/1.6.4/KeepingYouAwake-1.6.4.zip</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "info.marcel-dierkes.KeepingYouAwake" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5KESHV9W85")</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
