<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Viscosity.</string>
	<key>Identifier</key>
	<string>com.github.JaniTee.download.Viscosity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Viscosity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.sparklabs.com/downloads/Viscosity.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%pathname%</string>
		        <key>expected_authority_names</key>
		        <array>
		            <string>Developer ID Installer: Apple Inc. - SparkLabs Pty Ltd (34XR7GXFPX)</string>
		            <string>Developer ID Certification Authority</string>
		            <string>Apple Root CA</string>
		        </array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
